let ProvinceAndCityName = {
    "AllCity": [
        {
            "provinceName": "خراسان شمالی",
            "id": 0,
            "cities": [
                "شیروان",
                "اسفراین",
                "بجنورد",
                "جاجرم",
                "راز و جرگلان",
                "فاروج",
                "مانه و سملقان",
                "گرمه"
            ]
        },
        {
            "provinceName": "ایلام",
            "id": 2,
            "cities": [
                "ایوان",
                "آبدانان",
                "دهلران",
                "دره‌شهر",
                "مهران",
                "ایلام",
                "بدره",
                "سیروان",
                "ملکشاهی",
                "چرداول",
                "هلیلان",
                "چوار"
            ]
        },
        {
            "provinceName": "آذربایجان غربی",
            "id": 16,
            "cities": [
                "چالدران",
                "ارومیه",
                "اشنویه",
                "بوکان",
                "تکاب",
                "خوی",
                "سردشت",
                "سلماس",
                "شاهین دژ",
                "شوط",
                "ماکو",
                "مهاباد",
                "میاندوآب",
                "نقده",
                "ورزقان",
                "پلدشت",
                "پیرانشهر",
                "چایپاره",
                "چهار برج",
                "باروق"
            ]
        },
        {
            "provinceName": "کردستان",
            "id": 15,
            "cities": [
                "سقز",
                "بانه",
                "بیجار",
                "دهگلان",
                "دیواندره",
                "سروآباد",
                "سنندج",
                "قروه",
                "کامیاران",
                "مریوان"
            ]
        },
        {
            "provinceName": "خوزستان",
            "id": 31,
            "cities": [
                "آبادان",
                "آغاجاری",
                "امیدیه",
                "اندیکا",
                "اندیمشک",
                "اهواز",
                "ایذه",
                "باغ ملک",
                "باوی",
                "بندر ماهشهر",
                "بهبهان",
                "حمیدیه",
                "خرمشهر",
                "دزفول",
                "دشت آزادگان",
                "رامشیر",
                "رامهرمز",
                "شادگان",
                "شوش",
                "شوشتر",
                "کارون",
                "لالی",
                "مسجدسلیمان",
                "هفتکل",
                "هندیجان",
                "هویزه",
                "گتوند",
                "کرخه",
                "دزپارت"
            ]
        },
        {
            "provinceName": "فارس",
            "id": 17,
            "cities": [
                "آباده",
                "ارسنجان",
                "استهبان",
                "اقلید",
                "بوانات",
                "جهرم",
                "خرامه",
                "خرم بید",
                "خنج",
                "داراب",
                "رستم",
                "زرین دشت",
                "سروستان",
                "سپیدان",
                "شیراز",
                "فراشبند",
                "فسا",
                "فیروز آباد",
                "قیر و کارزین",
                "کازرون",
                "کوار",
                "لارستان",
                "لامرد",
                "مرودشت",
                "ممسنی",
                "مهر",
                "نی ریز",
                "پاسارگاد",
                "گراش",
                "بیضا",
                "خفر",
                "زرقان",
                "کوه‌چنار",
                "سرچهان",
                "بختگان"
            ]
        },
        {
            "provinceName": "قزوین",
            "id": 9,
            "cities": [
                "آبیک",
                "آوج",
                "البرز",
                "بوئین زهرا",
                "تاکستان",
                "قزوین"
            ]
        },
        {
            "provinceName": "آذربایجان شرقی",
            "id": 28,
            "cities": [
                "آذرشهر",
                "اسکو",
                "اهر",
                "بناب",
                "تبریز",
                "جلفا",
                "خداآفرین",
                "شبستر",
                "عجب شیر",
                "کلیبر",
                "مراغه",
                "مرند",
                "ملکان",
                "میانه",
                "هریس",
                "هشترود",
                "چاراویماق",
                "هوراند"
            ]
        },
        {
            "provinceName": "سمنان",
            "id": 12,
            "cities": [
                "آرادان",
                "دامغان",
                "سرخه",
                "سمنان",
                "شاهرود",
                "مهدی شهر",
                "میامی",
                "گرمسار"
            ]
        },
        {
            "provinceName": "اصفهان",
            "id": 13,
            "cities": [
                "آران و بیدگل",
                "اصفهان",
                "برخوار",
                "بوئین و میاندشت",
                "تیران و کرون",
                "خمینی شهر",
                "خوانسار",
                "خور و بیابانک",
                "دهاقان",
                "سمیرم",
                "شاهین شهر و میمه",
                "شهرضا",
                "فریدن",
                "فریدون شهر",
                "فلاورجان",
                "کاشان",
                "لنجان",
                "مبارکه",
                "نائین",
                "نجف آباد",
                "نطنز",
                "چادگان",
                "گلپایگان",
                "هرند",
                "ورزنه",
                "جرقویه",
                "کوهپایه"
            ]
        },
        {
            "provinceName": "گلستان",
            "id": 21,
            "cities": [
                "آزادشهر",
                "آق قلا",
                "بندر گز",
                "ترکمن",
                "رامیان",
                "علی آباد کتول",
                "کردکوی",
                "کلاله",
                "مراوه تپه",
                "مینودشت",
                "گالیکش",
                "گرگان",
                "گمیشان",
                "گنبد کاووس"
            ]
        },
        {
            "provinceName": "گیلان",
            "id": 10,
            "cities": [
                "آستارا",
                "آستانه اشرفیه",
                "املش",
                "بندر انزلی",
                "رشت",
                "رضوانشهر",
                "رودبار",
                "رودسر",
                "سیاهکل",
                "شفت",
                "صومعه سرا",
                "طوالش",
                "فومن",
                "لاهیجان",
                "لنگرود",
                "ماسال",
                "خمام"
            ]
        },
        {
            "provinceName": "مرکزی",
            "id": 4,
            "cities": [
                "آشتیان",
                "اراک",
                "تفرش",
                "خمین",
                "خنداب",
                "دلیجان",
                "زرندیه",
                "ساوه",
                "شازند",
                "فراهان",
                "کمیجان",
                "محلات"
            ]
        },
        {
            "provinceName": "مازندران",
            "id": 20,
            "cities": [
                "آمل",
                "بابل",
                "بابلسر",
                "بهشهر",
                "تنکابن",
                "جویبار",
                "رامسر",
                "ساری",
                "سوادکوه شمالی",
                "سوادکوه",
                "سیمرغ",
                "عباس آباد",
                "فریدونکنار",
                "قائم شهر",
                "کلاردشت",
                "محمودآباد",
                "میاندورود",
                "نکا",
                "نور",
                "نوشهر",
                "چالوس",
                "گلوگاه"
            ]
        },
        {
            "provinceName": "یزد",
            "id": 29,
            "cities": [
                "ابرکوه",
                "اردستان",
                "اردکان",
                "اشکذر",
                "بافق",
                "بهاباد",
                "تفت",
                "خاتم",
                "مهریز",
                "میبد",
                "یزد",
                "مروست"
            ]
        },
        {
            "provinceName": "زنجان",
            "id": 11,
            "cities": [
                "ابهر",
                "ایجرود",
                "خدابنده",
                "خرمدره",
                "زنجان",
                "سلطانیه",
                "طارم",
                "ماه نشان"
            ]
        },
        {
            "provinceName": "هرمزگان",
            "id": 30,
            "cities": [
                "ابوموسی",
                "بستک",
                "بشاگرد",
                "بندر لنگه",
                "بندرعباس",
                "حاجی آباد",
                "خمیر",
                "رودان",
                "سیریک",
                "قشم",
                "میناب",
                "پارسیان"
            ]
        },
        {
            "provinceName": "اردبیل",
            "id": 19,
            "cities": [
                "اردبیل",
                "بیله سوار",
                "خلخال",
                "سراب",
                "سرعین",
                "کوثر",
                "مشگین شهر",
                "نمین",
                "نیر",
                "پارس آباد",
                "گرمی",
                "اصلاندوز",
                "انگوت"
            ]
        },
        {
            "provinceName": "چهارمحال و بختیاری",
            "id": 6,
            "cities": [
                "اردل",
                "بروجن",
                "بن",
                "سامان",
                "شهرکرد",
                "فارسان",
                "لردگان",
                "خانمیرزا"
            ]
        },
        {
            "provinceName": "کرمان",
            "id": 1,
            "cities": [
                "ارزوئیه",
                "انار",
                "شهرستان بافت",
                "بردسیر",
                "بم",
                "جیرفت",
                "رابر",
                "راور",
                "رفسنجان",
                "رودبار جنوب",
                "ریگان",
                "زرند",
                "سیرجان",
                "شهربابک",
                "عنبرآباد",
                "فاریاب",
                "فهرج",
                "قلعه گنج",
                "کرمان",
                "کهنوج",
                "کوهبنان",
                "منوجان",
                "نرماشیر"
            ]
        },
        {
            "provinceName": "لرستان",
            "id": 3,
            "cities": [
                "ازنا",
                "الیگودرز",
                "بروجرد",
                "خرم آباد",
                "دلفان",
                "چگنی",
                "دورود",
                "رومشکان",
                "سلسله",
                "کوهدشت",
                "پلدختر"
            ]
        },
        {
            "provinceName": "همدان",
            "id": 8,
            "cities": [
                "اسدآباد",
                "بهار",
                "تویسرکان",
                "رزن",
                "فامنین",
                "کبودرآهنگ",
                "ملایر",
                "نهاوند",
                "همدان",
                "درگزین"
            ]
        },
        {
            "provinceName": "کرمانشاه",
            "id": 7,
            "cities": [
                "اسلام آباد غرب",
                "ثلاث باباجانی",
                "دالاهو",
                "روانسر",
                "سرپل ذهاب",
                "سنقر",
                "صحنه",
                "قصر شیرین",
                "کرمانشاه",
                "کنگاور",
                "هرسین",
                "پاوه",
                "گیلانغرب"
            ]
        },
        {
            "provinceName": "تهران",
            "id": 25,
            "cities": [
                "اسلامشهر",
                "بهارستان",
                "تهران",
                "دماوند",
                "رباط کریم",
                "ری",
                "شمیرانات",
                "شهریار",
                "فیروزکوه",
                "قدس",
                "قرچک",
                "ملارد",
                "ورامین",
                "پاکدشت",
                "پردیس",
                "پیشوا"
            ]
        },
        {
            "provinceName": "البرز",
            "cities": [
                "اشتهارد",
                "ساوجبلاغ",
                "طالقان",
                "فردیس",
                "کرج",
                "نظرآباد",
                "چهارباغ"
            ]
        },
        {
            "provinceName": "سیستان و بلوچستان",
            "id": 24,
            "cities": [
                "ایرانشهر",
                "خاش",
                "دلگان",
                "زابل",
                "زاهدان",
                "زهک",
                "سراوان",
                "سرباز",
                "سیب و سوران",
                "فنوج",
                "قصرقند",
                "کنارک",
                "مهرستان",
                "میرجاوه",
                "نیک شهر",
                "نیمروز",
                "هامون",
                "هیرمند",
                "چابهار",
                "گلشن",
                "زرآباد",
                "لاشار",
                "تفتان",
                "بمپور",
                "راسک",
                "دشتیاری"
            ]
        },
        {
            "provinceName": "خراسان رضوی",
            "id": 22,
            "cities": [
                "باخرز",
                "بجستان",
                "بردسکن",
                "طرقبه شاندیز",
                "تایباد",
                "تربت جام",
                "تربت حیدریه",
                "جوین",
                "خلیل آباد",
                "خواف",
                "خوشاب",
                "داورزن",
                "درگز",
                "رشتخوار",
                "زاوه",
                "سبزوار",
                "سرخس",
                "فریمان",
                "فیروزه",
                "قوچان",
                "کلات",
                "مشهد",
                "مه ولات",
                "نیشابور",
                "چناران",
                "گناباد",
                "صالح آباد",
                "زبرخان",
                "ششتمد",
                "کوهسرخ",
                "گلبهار"
            ]
        },
        {
            "provinceName": "کهگیلویه و بویراحمد",
            "id": 14,
            "cities": [
                "باشت",
                "بهمئی",
                "دنا",
                "کهگیلویه",
                "لنده",
                "چرام",
                "گچساران",
                "مارگون"
            ]
        },        
        {
            "provinceName": "خراسان جنوبی",
            "id": 23,
            "cities": [
                "بشرویه",
                "بیرجند",
                "خوسف",
                "درمیان",
                "زیرکوه",
                "سرایان",
                "سربیشه",
                "طبس",
                "فردوس",
                "قائنات",
                "نهبندان"
            ]
        },
        {
            "provinceName": "بوشهر",
            "id": 18,
            "cities": [
                "بوشهر",
                "تنگستان",
                "جم",
                "دشتستان",
                "دشتی",
                "دیلم",
                "دیر",
                "عسلویه",
                "کنگان",
                "گناوه"
            ]
        },
        {
            "provinceName": "قم",
            "id": 26,
            "cities": [
                "قم",
                "جعفرآباد",
                "کهک"
            ]
        }
    ]
}